<a href="https://colab.research.google.com/github/shrenikgit07/PythonNew/blob/Module3/Module3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#To open a text file as csv file, read csv file, display column names( first line) and other details (from second line to last line) 
with open('/content/sample_data/test.txt') as csv_file:
    csv_reader = csv.reader(csv_file, delimiter=',')
    line_count = 0
    for row in csv_reader:
        if line_count == 0:
            print(f'Column names are {", ".join(row)}')
            line_count += 1
        else:
            print(f'\t{row[0]} works in the {row[1]} department, and was born in {row[2]}.')
            line_count += 1
    print(f'Processed {line_count} lines.')

NameError: ignored

In [ ]:
# Program to read entire text file
with open('/content/sample_data/employee_birthday.txt') as f:
  contents = f.read()              #Reads all the lines of the file as it is  
  #contents = f.readline()         #Reads First line of the file
  #contents = f.readlines()        #Reads all lines of the file as a single record
  print(contents)

name,department,birthday month
John Smith,Accounting,November
Erica Meyers,IT,March

In [ ]:
#Program to read no of lines in the file
with open('/content/sample_data/employee_birthday.txt') as f:
  lines = f.readlines()
  count=0
  for line in lines:
    count+=1
    print(f'line {count}: {line}')
  print("No. of lines in the file:",count)

line 1: name,department,birthday month

line 2: John Smith,Accounting,November

line 3: Erica Meyers,IT,March
No. of lines in the file: 3

In [ ]:
#Read first n lines of the file
f= open('/content/sample_data/employee_birthday.txt', 'r')
count= int(input('enter no of lines'))
for i in range(count):
  v=f.readline()
  print(v)

enter no of lines2
name,department,birthday month

John Smith,Accounting,November

In [ ]:
#Write text to a file
i=0
f=open('/content/sample_data/employee1.txt','w')
for i in range(100):
  f.write("%d \n" % (i+1))
f.close()

lines=['Readme', 'This is first line in the file']
f=open('/content/sample_data/employee.txt','w')
for i in lines:
  f.write(i)                        #writelines() : For a list of string elements, each string is inserted in the text file.Used to insert multiple strings at a single time.
                                    #File_object.writelines(L) for L = [str1, str2, str3] 
  f.write("\n")
f.close()

In [ ]:
#Append text to a file
lines=['Readme', 'This is first line in the file']
f=open('/content/sample_data/employee1.txt','a')
for i in lines:
  f.write(i)
  
f.close()

In [ ]:
#Read numbers from a file and write even and odd numbers to separate files
f=open('/content/sample_data/employee1.txt', 'r')
lines=f.readlines()
for line in lines:
  for x in line.split():        #this function split the line into strings
    if (int(x) % 2)==0:
      f1=open('/content/sample_data/even1.txt', 'a')
      f1.writelines(x)
      f1.write("\n")
    else:
      f2=open('/content/sample_data/odd1.txt', 'a')
      f2.writelines(x)
      f2.write("\n")

In [ ]:
#Count characters,words, lines of a file
with open('/content/sample_data/test.txt') as f:
  lines = f.readlines()
  count=0
  for line in lines:
    count+=1
    #print(f'line {count}: {line}')
  print("No. of lines in the file:",count)
  print("\n")
  w=0
  for line in lines:
    for words in line.split(','):
      w+=1
      #print(f'words {w}: {words}')
  print("No. of words in the file:",w)
  print("\n")
  c=0
  for line in lines:
    for words in line.split(','):
      for charas in words:
        if charas.isalpha():
          c+=1
          #print(f'character {c}:{charas}')
  print("No of Characters are:",c)

No. of lines in the file: 8


No. of words in the file: 14


No of Characters are: 596

In [ ]:
#Write list to a file
lines=['EMP ID: 101', 'Name: D Subhash','Ref:255','Salary:45000','D.O.B:8-4-1985']
f=open('/content/sample_data/emp.txt','w')
for i in lines:
  f.write(i)                        #writelines() : For a list of string elements, each string is inserted in the text file.Used to insert multiple strings at a single time.
                                    #File_object.writelines(L) for L = [str1, str2, str3] 
  f.write("\n")
f.close()

In [ ]:
import pandas as pd

In [ ]:
#To read a CSV file into dataframe and display it
df=pd.read_csv('/content/sample_data/swe1.csv')
print(df)

  Object  X  Y
0      A  1  1
1      B  2  1
2      C  4  3
3      D  5  4

In [ ]:
#To read a csv file to dataframe and get details of it
df=pd.read_csv('/content/sample_data/titanic.csv')
#df.info()       #provides technical summaryof entire dataset
df.head()         #provides details of few rows of dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Unnamed: 12
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,NaN
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,NaN
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,NaN

In [ ]:
ages=df['Age']            #To select specific single column Age from the dataframe
print(ages.head())        #Tp print values of the selected column      
print(df['Age'].shape)    #To find total no of values in that column

age_sex= df[['Age','Sex']]  #To selct multiple columns at atime
print(age_sex.head())
print(df[['Age','Sex']].shape)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64
(891,)
    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male
(891, 2)

In [ ]:
#Given a datafram, select rows based on condition   passengers age above 35 and sex- female and class is 2 and 3
ageabove35 = df[(df['Age']>35) & (df['Sex']=='female') & (df['Pclass'].isin([2,3])) ]
print(ageabove35.head())
print(ageabove35.shape)

x=df[df['Age'].isnull()]              #To select the rows having Age as not a number NaN
print(x.head())

y=df[df['Age'].notna()]               #To selct the row age having a exsisting value or non missing value
print(y.head())

     PassengerId  Survived  Pclass  \
15            16         1       2
25            26         1       3
40            41         0       3
132          133         0       3
161          162         1       2

                                                  Name     Sex   Age  SibSp  \
15                     Hewlett, Mrs. (Mary D Kingcome)  female  55.0      0
25   Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  female  38.0      1
40      Ahlin, Mrs. Johan (Johanna Persdotter Larsson)  female  40.0      1
132     Robins, Mrs. Alexander A (Grace Charity Laury)  female  47.0      1
161  Watt, Mrs. James (Elizabeth "Bessie" Inglis Mi...  female  40.0      0

     Parch      Ticket     Fare Cabin Embarked  Unnamed: 12
15       0      248706  16.0000   NaN        S          NaN
25       5      347077  31.3875   NaN        S          NaN
40       0        7546   9.4750   NaN        S          NaN
132      0   A/5. 3337  14.5000   NaN        S          NaN
161      0  C.A. 33595  15.7500   NaN        S          NaN
(35, 13)
    PassengerId  Survived  Pclass                           Name     Sex  Age  \
5             6         0       3               Moran, Mr. James    male  NaN
17           18         1       2   Williams, Mr. Charles Eugene    male  NaN
19           20         1       3        Masselmani, Mrs. Fatima  female  NaN
26           27         0       3        Emir, Mr. Farred Chehab    male  NaN
28           29         1       3  O'Dwyer, Miss. Ellen "Nellie"  female  NaN

    SibSp  Parch  Ticket     Fare Cabin Embarked  Unnamed: 12
5       0      0  330877   8.4583   NaN        Q          NaN
17      0      0  244373  13.0000   NaN        S          NaN
19      0      0    2649   7.2250   NaN        C          NaN
26      0      0    2631   7.2250   NaN        C          NaN
28      0      0  330959   7.8792   NaN        Q          NaN
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked  Unnamed: 12
0      0         A/5 21171   7.2500   NaN        S          NaN
1      0          PC 17599  71.2833   C85        C          NaN
2      0  STON/O2. 3101282   7.9250   NaN        S          NaN
3      0            113803  53.1000  C123        S          NaN
4      0            373450   8.0500   NaN        S          NaN

In [ ]:
#Given a dataframe showing the name,occupation,salary of people. Find the average salary per occupation
df=pd.read_csv('/content/sample_data/Salaries.csv')
#print(df)
print(df.Occupation.unique())
print(df[['Occupation','Salary']].groupby('Occupation').mean())

['GENERAL MANAGER' 'CAPTAIN III' 'BATTALION CHIEF' 'CHIEF OF POLICE'
 'ANESTHETIST']
                        Salary
Occupation
ANESTHETIST      240076.426000
BATTALION CHIEF  259037.467727
CAPTAIN III      314688.810000
CHIEF OF POLICE  255325.119231
GENERAL MANAGER  329719.874167

In [ ]:
#Convert python objects to JSON strings. Print all values
import json
python_dict =  {"name": "David", "age": 6, "class":"I"}
python_list =  ["Red", "Green", "Black"]
python_str =  "Python Json"
python_int =  (1234)
python_float =  (21.34)
python_T =  (True)
python_F =  (False)
python_N =  (None)

json_dict = json.dumps(python_dict)
json_list = json.dumps(python_list)
json_str = json.dumps(python_str)
json_num1 = json.dumps(python_int)
json_num2 = json.dumps(python_float)
json_t = json.dumps(python_T)
json_f = json.dumps(python_F)
json_n = json.dumps(python_N)

print("json dict : ", json_dict)
print("jason list : ", json_list)
print("json string : ", json_str)
print("json number1 : ", json_num1)
print("json number2 : ", json_num2)
print("json true : ", json_t)
print("json false : ", json_f)
print("json null : ", json_n)

json dict :  {"name": "David", "age": 6, "class": "I"}
jason list :  ["Red", "Green", "Black"]
json string :  "Python Json"
json number1 :  1234
json number2 :  21.34
json true :  true
json false :  false
json null :  null

In [ ]:
#Write a pandas program to readspecific columns from a given excel file.
df.to_excel('/content/sample_data/Salaries.xls',sheet_name='Sheet1',index=False)   
#First read csv file into dataframe, convert to excel, select specific column
print(df)
df['Salary']

    Id          EmployeeName       Occupation     Salary
0    1        NATHANIEL FORD  GENERAL MANAGER  567595.43
1    2          GARY JIMENEZ      CAPTAIN III  538909.28
2    3        ALBERT PARDINI      CAPTAIN III  335279.91
3    4     CHRISTOPHER CHONG  GENERAL MANAGER  332343.61
4    5       PATRICK GARDNER  GENERAL MANAGER  326373.19
5    6        DAVID SULLIVAN  GENERAL MANAGER  316285.74
6    7             ALSON LEE  GENERAL MANAGER  315981.05
7    8         DAVID KUSHNER  GENERAL MANAGER  307899.46
8    9        MICHAEL MORRIS  GENERAL MANAGER  303427.55
9   10    JOANNE HAYES-WHITE  GENERAL MANAGER  302377.73
10  11         ARTHUR KENNEY  GENERAL MANAGER  299494.17
11  12      PATRICIA JACKSON  GENERAL MANAGER  297608.92
12  13     EDWARD HARRINGTON  GENERAL MANAGER  294580.02
13  14           JOHN MARTIN  GENERAL MANAGER  292671.62
14  15        DAVID FRANKLIN  BATTALION CHIEF  286347.05
15  16       RICHARD CORRIEA  BATTALION CHIEF  286213.86
16  17              AMY HART  CHIEF OF POLICE  284720.43
17  18        SEBASTIAN WONG  CHIEF OF POLICE  278569.21
18  19            MARTY ROSS      CAPTAIN III  276434.22
19  20         ELLEN MOFFATT      CAPTAIN III  274550.25
20  21            VENUS AZAR      CAPTAIN III  274190.27
21  22          JUDY MELINEK      CAPTAIN III  273771.21
22  23         GEORGE GARCIA      CAPTAIN III  273702.71
23  24         VICTOR WYRSCH      CAPTAIN III  270672.63
24  25       JOSEPH DRISCOLL  CHIEF OF POLICE  270324.91
25  26          GREGORY SUHR  CHIEF OF POLICE  267992.59
26  27           JOHN HANLEY  BATTALION CHIEF  265784.56
27  28        RAYMOND GUZMAN  BATTALION CHIEF  265463.46
28  29        DENISE SCHMITT  BATTALION CHIEF  264074.60
29  30         MONICA FIELDS  BATTALION CHIEF  261366.14
30  31       HARLAN KELLY-JR  BATTALION CHIEF  260297.66
31  32           DAVID SHINN  BATTALION CHIEF  259927.11
32  33           GARY AMELIO  BATTALION CHIEF  259684.88
33  34            JOHN TURSI  BATTALION CHIEF  258588.39
34  35             JOSE VELO  BATTALION CHIEF  258364.22
35  36            KHOA TRINH  BATTALION CHIEF  257540.09
36  37          SUSAN CURRIN  BATTALION CHIEF  257124.44
37  38           JAMES BOSCH  BATTALION CHIEF  253269.44
38  39            JONES WONG  BATTALION CHIEF  251935.01
39  40          BRENDAN WARD  BATTALION CHIEF  251685.16
40  41      MICHAEL THOMPSON  BATTALION CHIEF  250595.39
41  42         THOMAS ABBOTT  BATTALION CHIEF  250408.49
42  43       THOMAS SIRAGUSA  BATTALION CHIEF  250339.35
43  44      MICHAEL THOMPSON  BATTALION CHIEF  250317.93
44  45  SHARON MCCOLE WICHER  BATTALION CHIEF  250122.04
45  46             EDWIN LEE  BATTALION CHIEF  249375.02
46  47      BRYAN RUBENSTEIN  CHIEF OF POLICE  249293.30
47  48          TRENT RHORER  CHIEF OF POLICE  248895.77
48  49          JAMES DUDLEY  CHIEF OF POLICE  248718.64
49  50               KEN YEE  CHIEF OF POLICE  248434.39
50  51       KIRK RICHARDSON  CHIEF OF POLICE  247254.61
51  52        BARBARA GARCIA  CHIEF OF POLICE  246305.62
52  53      MICHAEL ROLOVICH  CHIEF OF POLICE  244687.81
53  54         DARRYL HUNTER  CHIEF OF POLICE  242742.85
54  55          RAY CRAWFORD  CHIEF OF POLICE  241286.42
55  56         KEVIN CASHMAN      ANESTHETIST  241211.17
56  57   BENJAMIN ROSENFIELD      ANESTHETIST  240846.30
57  58          MARK KEARNEY      ANESTHETIST  240019.10
58  59          DOUGLAS RIBA      ANESTHETIST  239426.36
59  60        AI-KYUNG CHUNG      ANESTHETIST  238879.20

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.

0     567595.43
1     538909.28
2     335279.91
3     332343.61
4     326373.19
5     316285.74
6     315981.05
7     307899.46
8     303427.55
9     302377.73
10    299494.17
11    297608.92
12    294580.02
13    292671.62
14    286347.05
15    286213.86
16    284720.43
17    278569.21
18    276434.22
19    274550.25
20    274190.27
21    273771.21
22    273702.71
23    270672.63
24    270324.91
25    267992.59
26    265784.56
27    265463.46
28    264074.60
29    261366.14
30    260297.66
31    259927.11
32    259684.88
33    258588.39
34    258364.22
35    257540.09
36    257124.44
37    253269.44
38    251935.01
39    251685.16
40    250595.39
41    250408.49
42    250339.35
43    250317.93
44    250122.04
45    249375.02
46    249293.30
47    248895.77
48    248718.64
49    248434.39
50    247254.61
51    246305.62
52    244687.81
53    242742.85
54    241286.42
55    241211.17
56    240846.30
57    240019.10
58    239426.36
59    238879.20
Name: Salary, dtype: float64